CSI API ETABS v1
cLinkObj.GetSelected Method
 Retrieves the selected status for a link object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSelected(
	string Name,
	ref bool Selected
)
Function GetSelected (
	Name As String,
	ByRef Selected As Boolean
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.GetSelected(Name,
	Selected)
int GetSelected(
	String^ Name,
	bool% Selected
)
abstract GetSelected :
        Name : string *
        Selected : bool byref -> int
Parameters
Name
Type: System.String
The name of an existing link object.
Selected
Type: System.Boolean
This item is True if the specified link object is selected; otherwise it is False.
Return Value
Type: Int32
Returns zero if the selected status is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim Selected As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'set link object selected
       ret = SapModel.LinkObj.SetSelected("ALL", True, eItemType.Group)
   'get link object selected status
       ret = SapModel.LinkObj.GetSelected(Name, Selected)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace